; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v3 ?v11)
             (pred_8 ?v12 ?v6)
             (pred_2 ?v3 ?v6)
             (pred_1 ?v5 ?v3 )
	     (pred_4 ?v3)
             (pred_10 ?v2)
             (pred_7 ?v12)
             (pred_3 ?v6)
             (pred_6 ?v3)
             (pred_12 ?v12)
             (pred_9 ?v3)
             (pred_5 ))



(:action op_4
:parameters (?v8 ?v1 ?v4 ?v10)
:precondition (and (pred_10 ?v8) (pred_10 ?v1) (pred_7 ?v4) (pred_3 ?v10)
          (pred_11 ?v8 ?v1) (pred_8 ?v4 ?v10)
                   (pred_2 ?v1 ?v10) (pred_4 ?v8) 
                   (pred_6 ?v1) (pred_12 ?v4))
:effect (and  (pred_9 ?v1) (not (pred_6 ?v1))))


(:action op_2
:parameters (?v8 ?v9)
:precondition (and (pred_10 ?v8) (pred_10 ?v9)
               (pred_4 ?v8) (pred_11 ?v8 ?v9) (pred_9 ?v9))
:effect (and (pred_4 ?v9) (not (pred_4 ?v8))))

(:action op_1
:parameters (?v8 ?v4)
:precondition (and (pred_10 ?v8) (pred_7 ?v4) 
                  (pred_4 ?v8) (pred_1 ?v4 ?v8) (pred_5 ))
:effect (and (pred_12 ?v4)
   (not (pred_1 ?v4 ?v8)) (not (pred_5 ))))


(:action op_3
:parameters (?v8 ?v13 ?v7)
:precondition (and (pred_10 ?v8) (pred_7 ?v13) (pred_7 ?v7)
                  (pred_4 ?v8) (pred_12 ?v7) (pred_1 ?v13 ?v8))
:effect (and (pred_12 ?v13) (pred_1 ?v7 ?v8)
        (not (pred_12 ?v7)) (not (pred_1 ?v13 ?v8))))

(:action op_5
:parameters (?v8 ?v4)
:precondition (and (pred_10 ?v8) (pred_7 ?v4) 
                  (pred_4 ?v8) (pred_12 ?v4))
:effect (and (pred_5 ) (pred_1 ?v4 ?v8) (not (pred_12 ?v4)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_01 obj_03 obj_04 obj_06 obj_21 obj_18 obj_13 obj_10 obj_15 obj_07 obj_14 obj_16 obj_20 obj_22 obj_19
    obj_02 obj_05 obj_09
    obj_08 obj_11 obj_17
    )

    (:init
       (pred_5)

       (pred_10 obj_12)
       (pred_10 obj_01)
       (pred_10 obj_03)
       (pred_10 obj_04)
       (pred_10 obj_06)
       (pred_10 obj_21)
       (pred_10 obj_18)
       (pred_10 obj_13)
       (pred_10 obj_10)
       (pred_10 obj_15)
       (pred_10 obj_07)
       (pred_10 obj_14)
       (pred_10 obj_16)
       (pred_10 obj_20)
       (pred_10 obj_22)
       (pred_10 obj_19)
       (pred_3 obj_02)
       (pred_3 obj_05)
       (pred_3 obj_09)
       (pred_7 obj_08)
       (pred_7 obj_11)
       (pred_7 obj_17)

       (pred_11 obj_12 obj_06)
       (pred_11 obj_12 obj_01)
       (pred_11 obj_01 obj_21)
       (pred_11 obj_01 obj_03)
       (pred_11 obj_01 obj_12)
       (pred_11 obj_03 obj_18)
       (pred_11 obj_03 obj_04)
       (pred_11 obj_03 obj_01)
       (pred_11 obj_04 obj_13)
       (pred_11 obj_04 obj_03)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_06 obj_21)
       (pred_11 obj_06 obj_12)
       (pred_11 obj_21 obj_15)
       (pred_11 obj_21 obj_18)
       (pred_11 obj_21 obj_01)
       (pred_11 obj_21 obj_06)
       (pred_11 obj_18 obj_07)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_18 obj_03)
       (pred_11 obj_18 obj_21)
       (pred_11 obj_13 obj_14)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_10 obj_16)
       (pred_11 obj_10 obj_15)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_15 obj_20)
       (pred_11 obj_15 obj_07)
       (pred_11 obj_15 obj_21)
       (pred_11 obj_15 obj_10)
       (pred_11 obj_07 obj_22)
       (pred_11 obj_07 obj_14)
       (pred_11 obj_07 obj_18)
       (pred_11 obj_07 obj_15)
       (pred_11 obj_14 obj_19)
       (pred_11 obj_14 obj_13)
       (pred_11 obj_14 obj_07)
       (pred_11 obj_16 obj_20)
       (pred_11 obj_16 obj_10)
       (pred_11 obj_20 obj_22)
       (pred_11 obj_20 obj_15)
       (pred_11 obj_20 obj_16)
       (pred_11 obj_22 obj_19)
       (pred_11 obj_22 obj_07)
       (pred_11 obj_22 obj_20)
       (pred_11 obj_19 obj_14)
       (pred_11 obj_19 obj_22)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_10)
       (pred_2  obj_13 obj_02)
       (pred_2  obj_18 obj_05)
       (pred_2  obj_10 obj_09)
       (pred_9 obj_12)
       (pred_9 obj_01)
       (pred_9 obj_03)
       (pred_9 obj_04)
       (pred_9 obj_06)
       (pred_9 obj_21)
       (pred_9 obj_15)
       (pred_9 obj_07)
       (pred_9 obj_14)
       (pred_9 obj_16)
       (pred_9 obj_20)
       (pred_9 obj_22)
       (pred_9 obj_19)

       (pred_8  obj_08 obj_02)
       (pred_8  obj_11 obj_05)
       (pred_8  obj_17 obj_09)
       (pred_1 obj_08 obj_01)
       (pred_1 obj_11 obj_03)
       (pred_1 obj_17 obj_19)
       (pred_4 obj_14)
    )

    (:goal (and
       (pred_1 obj_17 obj_20)
    ))
(:constraints
  (always (not (pred_4 obj_22)))
)
)

; plan
1. (op_2 obj_14 obj_19)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_19)
   goals met: 0 of 1
2. (op_1 obj_19 obj_17)
   deleted: (pred_1 obj_17 obj_19) (pred_5)
   added: (pred_12 obj_17)
   goals met: 0 of 1
3. (op_2 obj_19 obj_14)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_14)
   goals met: 0 of 1
4. (op_2 obj_14 obj_07)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_07)
   goals met: 0 of 1
5. (op_2 obj_07 obj_15)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_15)
   goals met: 0 of 1
6. (op_2 obj_15 obj_20)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_20)
   goals met: 0 of 1
7. (op_5 obj_20 obj_17)
   deleted: (pred_12 obj_17)
   added: (pred_5) (pred_1 obj_17 obj_20)
   goals met: 1 of 1
